{
    "courses": {
        "11111111111": {
            "id": 11111111111,
            "name": "Angular Basics",
            "author": "Zoran Petrovic",
            "dateOfChange": "2021-11-12",
            "desc": "Angular is the oldest, and at the same time the most powerful and complex software framework intended for frontend programming. Angular is an application software framework designed to create the client part of web applications. Angular was developed by Google; it was first published in 2010. Angular brings together all the tools needed to create complex, large web applications in a quick and easy way. In the course 'Angular for Beginners', with continuous practical work, we will learn the basics of architecture, tools and structure of Google's Angular platform, for the development of dynamic web applications and pages, basics of HTML, CSS and BootStrap CSS library to design the final look applications, as well as the basics of the RESTful API platform for downloading data presented on a page or application. As a last step, we will 'upload' the developed application to the Internet. Although Angular is a very complex tool, and although many of the previously mentioned topics and terms sound incomprehensible and complicated, in this course we will focus on the most important things with as simple explanations as possible to bring participants closer and understand the main concepts in web application development. The course is intended for people with basic knowledge of programming, but also for beginners who want to embark on an adventure called Angular. All that is needed for the course participants is a will and a positive attitude, and their knowledge will be upgraded from module to module.",
            "picture": "https://i.imgur.com/aYCw56T.png",
            "price": 9999,
            "numLections": 11,
            "category": "Web Development",
            "lang": "English",
            "avgRating": 4.97,
            "numUsers": 1231,
            "certified": "Yes"
        },
        "11111111112": {
            "id": 11111111112,
            "name": "HTML & CSS in 2 hours",
            "author": "Petar Petrovic",
            "dateOfChange": "2021-10-22",
            "desc": "HTML or HyperText Markup Language is a descriptive language used to create sites, more precisely the functionality of the elements of a website. On the other hand, CSS (Cascading Style Sheets) is a language used to edit the layout itself and format all the elements we see on the site. Although at first glance it may seem that HTML and CSS actually have the same function, their purpose is completely different, which has contributed to these two languages ​​being ideally complementary. During this HTML and CSS course, which you can attend as an online course or traditionally - in the classroom, and which is part of the associated programs, you will learn all the necessary details for working in these languages, starting with the most basic concepts to help you get a complete picture about HTML and CSS. By understanding these languages, you will learn how the web works and acquire computer literacy, which is one of the most sought-after knowledge of the 21st century. Once you have mastered HTML and CSS, you will be able to create web applications, or customize and maintain content on already established sites through code. In addition, you will be able to edit websites created in WordPress, style marketing emails and much more.",
            "picture": "https://i.imgur.com/IfoRpDP.png",
            "price": 8650,
            "numLections": 8,
            "category": "Web Development",
            "lang": "Serbian",
            "avgRating": 4.83,
            "numUsers": 1831,
            "certified": "Yes"
        },
        "11111111113": {
            "id": 11111111113,
            "name": "JavaScript Development",
            "author": "Novak Novakovic",
            "dateOfChange": "2021-09-02",
            "desc": "JavaScript is currently the number one programming language on the Internet, according to statistics from several sources. As many as 95% of websites use JS. JavaScript is usable not only in front-end development, but can also be used for backend, thanks to Node.js - an insanely fast server environment, and has even been used for some desktop applications. JavaScript is dynamic and interesting to work with. But above all, it is a programming language. You need to teach it with dedication, from the very basics. That's why the course is designed so that you first learn the simplest version of this language - Vanilla JavaScript. This version is just like the taste of vanilla - mild and without 'sweeteners'. It is a standard JavaScript language that has no additional resources or features. That's why it's great for you as a beginner. It allows you to understand how a programming language works, so you can create dynamic solutions on your own. Also, when you master Vanilla JavaScript, you will be able to recognize and eliminate errors in the code itself - that part of programming that the user does not see.",
            "picture": "https://i.imgur.com/WjBihYR.jpg",
            "price": 7235,
            "numLections": 17,
            "category": "Web Development",
            "lang": "English",
            "avgRating": 4.53,
            "numUsers": 530,
            "certified": "No"
        },
        "11111111114": {
            "id": 11111111114,
            "name": "C# OOP",
            "author": "Jovana Jovanovic",
            "dateOfChange": "2021-09-02",
            "desc": "As its name suggests, object-oriented programming is based on the concept of objects. This online programming course is just for you if you want to: gain knowledge of object-oriented programming - one of the most important concepts for developers, learn how to increase program flexibility with easier maintenance, you clearly understand the work of the program - data and their behavior (methods) are combined in the form of an object which significantly facilitates understanding, you progress quickly thanks to experienced lecturers and carefully prepared material with plenty of various illustrations.",
            "picture": "https://i.imgur.com/rG1aU9n.png",
            "price": 7235,
            "numLections": 12,
            "category": "Object Oriented Programming",
            "lang": "English",
            "avgRating": 4.88,
            "numUsers": 1126,
            "certified": "Yes"
        },
        "11111111115": {
            "id": 11111111115,
            "name": "Python OOP",
            "author": "Ivana Ivanovic",
            "dateOfChange": "2021-08-19",
            "desc": "The Python OOP course explains why it is good to program object and create and use classes, as well as who its members are, what is the difference between a class field and its methods and what both terms represent, what is meant by instantiating one class or creating its objects. Object programming, as the most common form of programming today, is present and widely used in Python programming, so during this course it is studied in detail in the context of this language. Through the course, all previously learned building blocks are renewed and supplemented with new, object-oriented program elements. The concept of data composition into objects is explained in detail. The notion of class in object programming, its components, ways in which it can be used is clarified - as an independent unit of the system or as a template for creating various objects. Advanced techniques in object programming are also discussed. structures, rewrites and overloads methods, and allows or forbids different members of the class from using access control.",
            "picture": "https://i.imgur.com/kKM1wzE.png",
            "price": 9455,
            "numLections": 23,
            "category": "Object Oriented Programming",
            "lang": "English",
            "avgRating": 4.66,
            "numUsers": 1356,
            "certified": "Yes"
        },
        "11111111116": {
            "id": 11111111116,
            "name": "Java Basics & OOP",
            "author": "Sava Savic",
            "dateOfChange": "2020-07-19",
            "desc": "Want to become a programmer, don't know where to start? We know! Knowledge of the Java programming language is your starting point for entering the world of programming. The basic course that we provide to our students, aims to get acquainted with the basics of object-oriented programming, using the Java programming language. Object-oriented programming is a concept of programming that is closest to the real world, the level of thinking and solving problems in everyday life. If you want to learn Java, we present our course Basics of Programming - Java. The course is adapted to beginners and no prior knowledge is required to attend classes because the course is designed so that learning starts from the very basics. The basic course that we provide to our students, aims to get acquainted with the basics of object-oriented programming, using the Java programming language. Object-oriented programming is a concept of programming that is closest to the real world, the level of thinking and solving problems in everyday life. The concept of abstraction in Java will be explained using abstract classes and interfaces. Storing data in RAM will be explained through strings and collections, while storing data in external memory will be explained in working with files.",
            "picture": "https://i.imgur.com/9Rq1ZWl.png",
            "price": 10995,
            "numLections": 27,
            "category": "Object Oriented Programming",
            "lang": "English",
            "avgRating": 4.79,
            "numUsers": 1559,
            "certified": "Yes"
        },
        "11111111117": {
            "id": 11111111117,
            "name": "Algorithm Basics",
            "author": "Ivan Ivanovic",
            "dateOfChange": "2020-07-19",
            "desc": "The Algorithm Basics course covers a wide range of algorithms and programming techniques. The aim of the course is to get acquainted with the most important algorithms used to solve practical problems that arise in computer science. The content of the course includes a review of data structures, mathematical algorithms, recursion and backtrack, graph theory, dynamic programming, geometric algorithms ... There are many online courses with similar content, so the fair question is: why is this course different from others? The three key things that make this particular course stand out are: structure, script and themes. Structure. The structure and organization of the course is defined so that it is simple and tailored to the needs of each user. Emphasis is placed on video materials that are easier to follow than reading written material. You will have a lot of statistics of your progress, you will be pointed out and explained mistakes, as well as possible additional material if necessary. In addition to the theoretical story, the course requires the implementation of the presented algorithms, as well as theoretical testing. The content of the course is defined to cover many scenarios, of which we single out three main ones: The course covers the necessary knowledge for national programming competitions for high school students, as well as for international competitions IOI and ACM. The course monitors the content of courses in algorithm design and analysis. The course covers the necessary knowledge of algorithms for most software companies. In addition to presenting a specific algorithm, the materials cover a lot of accompanying notes related to the same: the best approach to implementation, testing, complexity analysis, 'tricks' and generalizations ... We will talk about standard errors, both in implementation and in theory. solutions. Each example will be explained in detail and the solution will be presented through the process of developing the idea, and not just listed as a bolt from the blue. We hope that in as many situations as possible we will replace the question 'how can this come to my mind' with the question 'how did this not occur to me'.",
            "picture": "https://i.imgur.com/7ZvZAmi.jpg",
            "price": 9995,
            "numLections": 15,
            "category": "Algorithms",
            "lang": "Serbian",
            "avgRating": 4.65,
            "numUsers": 829,
            "certified": "No"
        },
        "11111111118": {
            "id": 11111111118,
            "name": "Algorithms for sorting",
            "author": "Jovan Jovanovic",
            "dateOfChange": "2021-02-10",
            "desc": "Sorting is one of the fundamental tasks in computing. Sorting involves linear editing of a string according to a given criterion (eg a string of numbers by size, a string of text lexicographically or by length, a string of structures based on the value of a field, etc.). In this course we will get acquainted with different types of sorting algorithms, both those that sort in place (eng. In place), and those that require additional string or auxiliary structure. We will talk about the performance of each of the algorithms, complexity, memory requirements and the like. The algorithms that will be processed are: Bubble sort, Selection sort, Insertion sort, Merge sort, Quicksort, Shell sort, and Heap sort.",
            "picture": "https://i.imgur.com/LMmLPWm.jpg",
            "price": 9125,
            "numLections": 9,
            "category": "Algorithms",
            "lang": "Serbian",
            "avgRating": 4.81,
            "numUsers": 876,
            "certified": "No"
        },
        "11111111119": {
            "id": 11111111119,
            "name": "Data Structures: Basic to Advanced",
            "author": "Tomislav Tomic",
            "dateOfChange": "2019-12-10",
            "desc": "Data structures are one of the basic ingredients in the recipe for creating efficient algorithms and good software design. Knowledge of how to create and design good data structures is essential to becoming a suitable programmer. This course will teach you how to master the fundamental ideas that underlie data structures. Learn and master the most common data structures in this comprehensive course, such as: static and dynamic arrays, single and double-linked lists, stacks, rows, priority rows, heaps, binary trees / binary search trees, hash tables, AVL trees, and binary indexed trees. This course provides you with high-quality animated videos that explain the multitude of data structures and how they are visually presented. You will learn how to use and create different data structures with simple step-by-step instructions. Each presented data structure will be accompanied by some working source code (in Java) in order to strengthen your understanding of the same. Also, at the end of the course, you will have to do several tasks and a quiz on multiple-choice questions in order to apply the acquired knowledge independently.",
            "picture": "https://i.imgur.com/lmVcFhi.jpg",
            "price": 9399,
            "numLections": 13,
            "category": "Data Structures",
            "lang": "Serbian",
            "avgRating": 4.36,
            "numUsers": 1002,
            "certified": "No"
        },
        "11111111110": {
            "id": 11111111110,
            "name": "Data Structures: A-Z",
            "author": "Nikola Nikolic",
            "dateOfChange": "2021-04-15",
            "desc": "Congratulations! You have found the most popular, complete and up-to-date online resource for learning data structures. Do you want to prepare for the next coding interview? Do you want to be a master at solving challenging algorithms? Are you interested in the field of data structures? Are you interested in playing with complex algorithms? Then this course is for you! You have to understand algorithms and data structures because I saw code written by people who didn't understand data structures and algorithms; and believe me, you don't want to be one of them. The whole course is based on one goal: to turn you into a professional programmer and to be able to write code as a professional. Are you afraid of coding interviews? Join me in this adventure, break your coding interview by mastering data structures and algorithms. There are many free tutorials and videos on YouTube. Why would you want to take this course? The answer is simple: the quality of teaching. So, from the very beginning to the very end, you will be sure that you will be in good hands and that you will follow every minute of the course, unlike reading many free tutorials and videos, you do not waste your precious time. Each section is equipped with a balanced mix of theory and implementation.",
            "picture": "https://i.imgur.com/jZAuXdx.jpg",
            "price": 11225,
            "numLections": 27,
            "category": "Data Structures",
            "lang": "English",
            "avgRating": 4.61,
            "numUsers": 651,
            "certified": "Yes"
        }
    },
    "users": {
        "-MNQo55Aw0tLdwahMZMK": {
            "adress": "Gogoljeva 39, Novi Sad",
            "dob": "1994-10-22",
            "email": "ppetrovic@webd.com",
            "firstName": "Petar",
            "pass": "petar123",
            "lastName": "Petrović",
            "telNum": "061456456",
            "userName": "petar"
        },
        "-MNQoCqEXydVTdCNV47C": {
            "adress": "Jug Bogdana 14, Zrenjanin",
            "dob": "1982-05-05",
            "email": "jjovanovic@webd.com",
            "firstName": "Jovana",
            "pass": "jovana123",
            "lastName": "Jovanović",
            "telNum": "062321321",
            "userName": "jovana"
        },
        "-MNQoJw2p9rci4Rm_rYY": {
            "adress": "Cara Lazara 9a, Kragujevac",
            "dob": "1990-09-17",
            "email": "mmarkovic@webd.com",
            "firstName": "Marko",
            "pass": "marko123",
            "lastName": "Marković",
            "telNum": "063876876",
            "userName": "marko"
        },
        "-MNQoR-5erkWvcm8Hdnk": {
            "adress": "Solunska 5, Niš",
            "dob": "1973-03-10",
            "email": "ffilipovic@webd.com",
            "firstName": "Filip",
            "pass": "filip123",
            "lastName": "Filipović",
            "telNum": "064159159",
            "userName": "filip"
        },
        "-MNQoWt_gDudX5W8TLQj": {
            "adress": "Ružićeva 32, Beograd",
            "dob": "1998-06-29",
            "email": "ttijanic@webd.com",
            "firstName": "Tijana",
            "pass": "tijana123",
            "lastName": "Tijanić",
            "telNum": "065753753",
            "userName": "tijana"
        }
    }
}